// src/app/pages/HomePage.ts
//
// Made with ❤️ by Maysara.



// ╔════════════════════════════════════════ PACK ════════════════════════════════════════╗

    import { Component, html, css, router } from '@je-es/client';

// ╚══════════════════════════════════════════════════════════════════════════════════════╝



// ╔════════════════════════════════════════ CORE ════════════════════════════════════════╗

    export class HomePage extends Component {
        async onMount() {
            // console.log('📍 HomePage mounted');
        }

        handleGetStarted(e: Event) {
            e.preventDefault();
            router.push('/todos');
        }

        render() {
            return html`
                <div class="home-page">
                    <section class="hero-section">
                    </section>
                </div>
            `;
        }

        styles() {
            return css`
            `;
        }
    }

// ╚══════════════════════════════════════════════════════════════════════════════════════╝